Repository: asda-projects/map
Catalog: frontend/lib/presentation/assets/l10n/intl_*.arb
Languages: th

# selectedLanguage
source: Language
th: ภาษา

source: Login
th: เข้าสู่ระบบ

# loginWith
source: Login with {provider}
th: เข้าสู่ระบบด้วย {provider}

source: Listen music
th: ฟังเพลง

source: Sign Up
th: สมัครสมาชิก

# signUpWith
source: Sign Up with {provider}
th: สมัครสมาชิกด้วย {provider}

source: Email
th: อีเมล

source: Password
th: รหัสผ่าน

# passwordTip
source: 8+ chars, 1 uppercase, 1 lowercase, 1 number, 1 symbol (@, #, $).
th: 8+ ตัวอักษร, 1 ตัวพิมพ์ใหญ่, 1 ตัวพิมพ์เล็ก, 1 ตัวเลข, 1 สัญลักษณ์ (@, #, $)

# forgotPwd
source: Forgot password?
th: ลืมรหัสผ่าน?

# noAccount
source: I do not have account!
th: ฉันไม่มีบัญชี!

# hasAccount
source: I already have account!
th: ฉันมีบัญชีอยู่แล้ว!

# requiredField
source: This field is required.
th: ช่องนี้จำเป็นต้องกรอก.

# invalidEmail
source: Enter a valid email.
th: กรุณากรอกอีเมลที่ถูกต้อง.

source: Invalid password.
th: รหัสผ่านไม่ถูกต้อง.

source: Invalid format.
th: รูปแบบไม่ถูกต้อง.

# invalidNumber
source: Enter a valid number.
th: กรุณากรอกตัวเลขที่ถูกต้อง.

# invalidForm
source: Form is invalid! Please check the fields.
th: แบบฟอร์มไม่ถูกต้อง! กรุณาตรวจสอบข้อมูลในช่องกรอก

# authGreetingsLogin
source: It's great to see you back again!
th: ดีใจที่ได้พบคุณอีกครั้ง!

# authGreetingsSignUp
source: Join us now and listen your heart beats!
th: มาร่วมกับเราและฟังเสียงหัวใจของคุณเต้น!
